#### Terraform Format and Style `success`
#### Terraform Initialization `success`
#### Terraform Validation `success`
#### Terraform Plan `failure`

<details><summary>Show Plan</summary>

```

terraform
data.terraform_remote_state.infra: Reading...
data.terraform_remote_state.database: Reading...
data.archive_file.lambda_confirm_user_artefact: Reading...
data.archive_file.lambda_login_artefact: Reading...
data.archive_file.lambda_confirm_user_artefact: Read complete after 0s [id=76ea7135b385d32457175c321d56c17f70f63170]
data.terraform_remote_state.database: Read complete after 0s
data.terraform_remote_state.infra: Read complete after 0s
data.archive_file.lambda_login_artefact: Read complete after 0s [id=0df430828407ec6cc6a72f883e046a201ce2e3e2]
data.aws_iam_policy_document.assume_role_lambda: Reading...
aws_iam_role.lambda: Refreshing state... [id=fiap-irango-lambda]
aws_cloudwatch_log_group.lambda_log_group: Refreshing state... [id=/aws/lambda/fiap-irango-lambda-login]
aws_apigatewayv2_api.default: Refreshing state... [id=ntn064xinl]
aws_security_group.lambda: Refreshing state... [id=sg-03eea15034fd9fe43]
data.aws_iam_policy_document.assume_role_lambda: Read complete after 0s [id=2690255455]
aws_iam_role_policy_attachment.AWSLambdaVPCAccessExecutionRole: Refreshing state... [id=fiap-irango-lambda-20240511134941553300000001]
aws_iam_role_policy_attachment.AWSLambdaBasicExecutionRole: Refreshing state... [id=fiap-irango-lambda-20240511134941775300000002]
aws_cognito_user_pool.default: Refreshing state... [id=us-east-1_TneceBpA3]
aws_cloudwatch_log_group.api_gateway_log_group: Refreshing state... [id=/aws/api_gw/fiap-irango-api-gateway]
aws_apigatewayv2_stage.default: Refreshing state... [id=fiap-irango-api-gateway-stage]
aws_cognito_user_pool_client.default: Refreshing state... [id=1npo3mlpdb954j95vvekoar4r1]
aws_lambda_function.login: Refreshing state... [id=fiap-irango-lambda-login]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
  - destroy
-/+ destroy and then create replacement

Terraform planned the following actions, but then encountered a problem:

  # aws_cloudwatch_log_group.lambda_confirm_user will be created
  + resource "aws_cloudwatch_log_group" "lambda_confirm_user" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + log_group_class   = (known after apply)
      + name              = "/aws/lambda/fiap-irango-lambda-confirm-user"
      + name_prefix       = (known after apply)
      + retention_in_days = 1
      + skip_destroy      = false
      + tags_all          = {
          + "Environment" = "studying"
          + "Service"     = "fiap-irango"
        }
    }

  # aws_cloudwatch_log_group.lambda_log_group will be destroyed
  # (because aws_cloudwatch_log_group.lambda_log_group is not in configuration)
  - resource "aws_cloudwatch_log_group" "lambda_log_group" {
      - arn               = "arn:aws:logs:us-east-1:166954469144:log-group:/aws/lambda/fiap-irango-lambda-login" -> null
      - id                = "/aws/lambda/fiap-irango-lambda-login" -> null
      - log_group_class   = "STANDARD" -> null
      - name              = "/aws/lambda/fiap-irango-lambda-login" -> null
      - retention_in_days = 1 -> null
      - skip_destroy      = false -> null
      - tags              = {} -> null
      - tags_all          = {
          - "Environment" = "studying"
          - "Service"     = "fiap-irango"
        } -> null
    }

  # aws_cognito_user.not_identified will be created
  + resource "aws_cognito_user" "not_identified" {
      + attributes            = {
          + "email"          = "no-reply@fiapirango.com"
          + "email_verified" = "true"
        }
      + creation_date         = (known after apply)
      + enabled               = true
      + id                    = (known after apply)
      + last_modified_date    = (known after apply)
      + mfa_setting_list      = (known after apply)
      + password              = (sensitive value)
      + preferred_mfa_setting = (known after apply)
      + status                = (known after apply)
      + sub                   = (known after apply)
      + user_pool_id          = "us-east-1_TneceBpA3"
      + username              = "no-reply@fiapirango.com"
    }

  # aws_cognito_user_pool.default will be updated in-place
  ~ resource "aws_cognito_user_pool" "default" {
        id                        = "us-east-1_TneceBpA3"
        name                      = "fiap-irango-cognito-user-pool"
        tags                      = {
            "Name" = "fiap-irango-cognito-user-pool"
        }
        # (10 unchanged attributes hidden)

      + lambda_config {
          + pre_sign_up = (known after apply)
        }

      ~ password_policy {
          - temporary_password_validity_days = 7 -> null
            # (5 unchanged attributes hidden)
        }

      ~ verification_message_template {
          ~ default_email_option = "CONFIRM_WITH_CODE" -> "CONFIRM_WITH_LINK"
        }

        # (6 unchanged blocks hidden)
    }

  # aws_cognito_user_pool_client.default will be updated in-place
  ~ resource "aws_cognito_user_pool_client" "default" {
      ~ explicit_auth_flows                           = [
          + "ALLOW_USER_SRP_AUTH",
            # (3 unchanged elements hidden)
        ]
        id                                            = "1npo3mlpdb954j95vvekoar4r1"
        name                                          = "fiap-irango-cognito-user-pool-client"
        # (17 unchanged attributes hidden)
    }

  # aws_iam_role.lambda will be destroyed
  # (because aws_iam_role.lambda is not in configuration)
  - resource "aws_iam_role" "lambda" {
      - arn                   = "arn:aws:iam::166954469144:role/fiap-irango-lambda" -> null
      - assume_role_policy    = jsonencode(
            {
              - Statement = [
                  - {
                      - Action    = "sts:AssumeRole"
                      - Effect    = "Allow"
                      - Principal = {
                          - Service = "lambda.amazonaws.com"
                        }
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> null
      - create_date           = "2024-05-11T13:49:40Z" -> null
      - force_detach_policies = false -> null
      - id                    = "fiap-irango-lambda" -> null
      - managed_policy_arns   = [
          - "arn:aws:iam::aws:policy/service-role/AWSLambdaBasicExecutionRole",
          - "arn:aws:iam::aws:policy/service-role/AWSLambdaVPCAccessExecutionRole",
        ] -> null
      - max_session_duration  = 3600 -> null
      - name                  = "fiap-irango-lambda" -> null
      - path                  = "/" -> null
      - tags                  = {} -> null
      - tags_all              = {
          - "Environment" = "studying"
          - "Service"     = "fiap-irango"
        } -> null
      - unique_id             = "AROASNX2DA4MIXREUMVUO" -> null
    }

  # aws_iam_role.lambda_confirm_user will be created
  + resource "aws_iam_role" "lambda_confirm_user" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "lambda.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "fiap-irango-lambda-confirm-user"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags_all              = {
          + "Environment" = "studying"
          + "Service"     = "fiap-irango"
        }
      + unique_id             = (known after apply)
    }

  # aws_iam_role.lambda_login will be created
  + resource "aws_iam_role" "lambda_login" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "lambda.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "fiap-irango-lambda-login"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags_all              = {
          + "Environment" = "studying"
          + "Service"     = "fiap-irango"
        }
      + unique_id             = (known after apply)
    }

  # aws_iam_role_policy_attachment.AWSLambdaBasicExecutionRole must be replaced
-/+ resource "aws_iam_role_policy_attachment" "AWSLambdaBasicExecutionRole" {
      ~ id         = "fiap-irango-lambda-20240511134941775300000002" -> (known after apply)
      ~ role       = "fiap-irango-lambda" -> "fiap-irango-lambda-login" # forces replacement
        # (1 unchanged attribute hidden)
    }

  # aws_iam_role_policy_attachment.AWSLambdaBasicExecutionRoleCon will be created
  + resource "aws_iam_role_policy_attachment" "AWSLambdaBasicExecutionRoleCon" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/service-role/AWSLambdaBasicExecutionRole"
      + role       = "fiap-irango-lambda-confirm-user"
    }

  # aws_iam_role_policy_attachment.AWSLambdaVPCAccessExecutionRole must be replaced
-/+ resource "aws_iam_role_policy_attachment" "AWSLambdaVPCAccessExecutionRole" {
      ~ id         = "fiap-irango-lambda-20240511134941553300000001" -> (known after apply)
      ~ role       = "fiap-irango-lambda" -> "fiap-irango-lambda-login" # forces replacement
        # (1 unchanged attribute hidden)
    }

  # aws_iam_role_policy_attachment.AWSLambdaVPCAccessExecutionRoleCon will be created
  + resource "aws_iam_role_policy_attachment" "AWSLambdaVPCAccessExecutionRoleCon" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/service-role/AWSLambdaVPCAccessExecutionRole"
      + role       = "fiap-irango-lambda-confirm-user"
    }

  # aws_lambda_function.confirm_user will be created
  + resource "aws_lambda_function" "confirm_user" {
      + architectures                  = (known after apply)
      + arn                            = (known after apply)
      + filename                       = "files/confirm_user_lambda_function_payload.zip"
      + function_name                  = "fiap-irango-lambda-confirm-user"
      + handler                        = "index.handler"
      + id                             = (known after apply)
      + invoke_arn                     = (known after apply)
      + last_modified                  = (known after apply)
      + memory_size                    = 128
      + package_type                   = "Zip"
      + publish                        = false
      + qualified_arn                  = (known after apply)
      + qualified_invoke_arn           = (known after apply)
      + reserved_concurrent_executions = -1
      + role                           = (known after apply)
      + runtime                        = "nodejs20.x"
      + signing_job_arn                = (known after apply)
      + signing_profile_version_arn    = (known after apply)
      + skip_destroy                   = false
      + source_code_hash               = "pt76IEC2VZnA/N1qji9LSaUtwSPzNJJzpYXZEXmKaVE="
      + source_code_size               = (known after apply)
      + tags                           = {
          + "Name" = "fiap-irango-lambda-confirm-user"
        }
      + tags_all                       = {
          + "Environment" = "studying"
          + "Name"        = "fiap-irango-lambda-confirm-user"
          + "Service"     = "fiap-irango"
        }
      + timeout                        = 5
      + version                        = (known after apply)

      + vpc_config {
          + ipv6_allowed_for_dual_stack = false
          + security_group_ids          = (known after apply)
          + subnet_ids                  = [
              + "subnet-0440bbf3c32ccb0dd",
              + "subnet-0c4000ad97af2bc36",
            ]
          + vpc_id                      = (known after apply)
        }
    }

  # aws_lambda_permission.cognito_trigger will be created
  + resource "aws_lambda_permission" "cognito_trigger" {
      + action              = "lambda:InvokeFunction"
      + function_name       = (known after apply)
      + id                  = (known after apply)
      + principal           = "cognito-idp.amazonaws.com"
      + source_arn          = "arn:aws:cognito-idp:us-east-1:166954469144:userpool/us-east-1_TneceBpA3"
      + statement_id        = "AllowExecutionFromCognito"
      + statement_id_prefix = (known after apply)
    }

  # aws_security_group.lambda will be destroyed
  # (because aws_security_group.lambda is not in configuration)
  - resource "aws_security_group" "lambda" {
      - arn                    = "arn:aws:ec2:us-east-1:166954469144:security-group/sg-03eea15034fd9fe43" -> null
      - description            = "inbound: all + outbound: all" -> null
      - egress                 = [
          - {
              - cidr_blocks      = [
                  - "0.0.0.0/0",
                ]
              - description      = ""
              - from_port        = 0
              - ipv6_cidr_blocks = []
              - prefix_list_ids  = []
              - protocol         = "-1"
              - security_groups  = []
              - self             = false
              - to_port          = 0
            },
        ] -> null
      - id                     = "sg-03eea15034fd9fe43" -> null
      - ingress                = [
          - {
              - cidr_blocks      = [
                  - "0.0.0.0/0",
                ]
              - description      = ""
              - from_port        = 0
              - ipv6_cidr_blocks = []
              - prefix_list_ids  = []
              - protocol         = "-1"
              - security_groups  = []
              - self             = false
              - to_port          = 0
            },
        ] -> null
      - name                   = "fiap-irango-security-group-lambda" -> null
      - owner_id               = "166954469144" -> null
      - revoke_rules_on_delete = false -> null
      - tags                   = {
          - "Name" = "fiap-irango-security-group-lambda"
        } -> null
      - tags_all               = {
          - "Environment" = "studying"
          - "Name"        = "fiap-irango-security-group-lambda"
          - "Service"     = "fiap-irango"
        } -> null
      - vpc_id                 = "vpc-0b79ba346a3e76bf8" -> null
    }

  # aws_security_group.lambda_confirm_user will be created
  + resource "aws_security_group" "lambda_confirm_user" {
      + arn                    = (known after apply)
      + description            = "inbound: all + outbound: all"
      + egress                 = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = ""
              + from_port        = 0
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "-1"
              + security_groups  = []
              + self             = false
              + to_port          = 0
            },
        ]
      + id                     = (known after apply)
      + ingress                = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = ""
              + from_port        = 0
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "-1"
              + security_groups  = []
              + self             = false
              + to_port          = 0
            },
        ]
      + name                   = "fiap-irango-security-group-lambda-confirm-user"
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags                   = {
          + "Name" = "fiap-irango-security-group-lambda-confirm-user"
        }
      + tags_all               = {
          + "Environment" = "studying"
          + "Name"        = "fiap-irango-security-group-lambda-confirm-user"
          + "Service"     = "fiap-irango"
        }
      + vpc_id                 = "vpc-0b79ba346a3e76bf8"
    }

  # aws_security_group.lambda_login will be created
  + resource "aws_security_group" "lambda_login" {
      + arn                    = (known after apply)
      + description            = "inbound: all + outbound: all"
      + egress                 = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = ""
              + from_port        = 0
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "-1"
              + security_groups  = []
              + self             = false
              + to_port          = 0
            },
        ]
      + id                     = (known after apply)
      + ingress                = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = ""
              + from_port        = 0
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "-1"
              + security_groups  = []
              + self             = false
              + to_port          = 0
            },
        ]
      + name                   = "fiap-irango-security-group-lambda-login"
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags                   = {
          + "Name" = "fiap-irango-security-group-lambda-login"
        }
      + tags_all               = {
          + "Environment" = "studying"
          + "Name"        = "fiap-irango-security-group-lambda-login"
          + "Service"     = "fiap-irango"
        }
      + vpc_id                 = "vpc-0b79ba346a3e76bf8"
    }

Plan: 12 to add, 2 to change, 5 to destroy.

Changes to Outputs:
  - client_id           = "1npo3mlpdb954j95vvekoar4r1" -> null
  - user_pool_id        = "us-east-1_TneceBpA3" -> null

```

</details>